package mmo.materialdata
{
	import mmo.framework.domain.flower.Flower;
	import mmo.framework.domain.flower.FlowerGift;

	public class FlowerData
	{
		public function FlowerData()
		{
		}
		
		/**
		  SELECT concat('"',f.Id,'":new Flower(',f.id,', "',f.Name,'", "',f.Description,
		  '", ',f.value,', ',f.IsScore,',',f.FlowerCharm,', ',f.FlowerLv,'),')
		  FROM `aox1`.`Flower` f;
		 */		
		/**
		 * Flower
		 * "{0}":new Flower({0}, "{1}", "{2}", {4}, {3}, {6}, {5}, {7}),
		 */		
		public static const flowerConfig:Object = {
			//exportData part begin

			"620":new Flower(620, "鲜花", "送给你。", 100, 1, 1, 1, 0),
			"621":new Flower(621, "友情", "你很不错，交个朋友吧！", 1000, 1, 9, 2, 0),
			"622":new Flower(622, "童趣", "一起玩吧~", 7000, 1, 49, 2, 0),
			"623":new Flower(623, "想你", "我想你啦~", 20000, 1, 99, 3, 0),
			"624":new Flower(624, "对你思念", "你尚未转身，我已开始想念。", 5, 0, 199, 3, 0),
			"625":new Flower(625, "想安慰你", "会有人因为你的难过而难过。", 5, 0, 199, 3, 0),
			"626":new Flower(626, "我们的幸福", "跟你一起看风景的感觉，好幸福。", 12, 0, 599, 3, 0),
			"627":new Flower(627, "挚友唯你", "我们是一辈子的好朋友。", 12, 0, 599, 3, 0),
			"628":new Flower(628, "情谊永恒", "永远和你在一起。", 19, 0, 999, 4, 0),
			"653":new Flower(653, "心之玫瑰", "我和你如此亲密，两颗心之间没有距离。", 29, 0, 1314, 4, 0),
			"662":new Flower(662, "可爱小熊", "有我陪伴，你永远不会寂寞。", 39, 0, 1711, 4, 0),
			"674":new Flower(674, "蔷薇誓言", "用蔷薇许下誓言，对你永远不变。", 59, 0, 2199, 5, 0),
			"736":new Flower(736, "女神的祝福", "愿光明女神永远守护你", 0, 1, 666, 3, 0),
			"754":new Flower(754, "无瑕", "送给如天使般纯洁无瑕的你。", 0, 1, 199, 3, 0),
			"788":new Flower(788, "红颜", "愿时光流过，你我容颜不改，情谊不变。", 0, 1, 199, 3, 0),
			"865":new Flower(865, "万圣花束", "万圣夜与你一起度过。", 27, 0, 1099, 4, 0),
			"866":new Flower(866, "公主殿下", "送给我心中的幽灵公主殿下。", 79, 0, 3999, 5, 0),
			"915":new Flower(915, "丝丝情谊", "天冷啦！睡觉要老实！乱蹬被子会感冒的哦~~~", 0, 1, 19, 2, 0),
			"916":new Flower(916, "雪花纷飞", "哦~下雪了，真想变成一片雪花，飞到你的身边~", 0, 1, 199, 3, 0),
			"1021":new Flower(1021, "倾世", "我倾倒了整个世界,只为摆正你的倒影。", 0, 1, 19, 2, 0),
			"1022":new Flower(1022, "暖暖冬日", "第一次见到你，我的心就像冬日晒到了阳光，有种温暖幸福的感觉。", 0, 1, 199, 3, 0),
			"1059":new Flower(1059, "华丽元宵", "用精美的花束送给我心中的花影公主，一起度过华丽的元宵。", 60, 0, 4504, 5, 0),
			"1060":new Flower(1060, "元宵的祝福", "愿你过一个快乐的元宵节！", 29, 0, 1186, 4, 0),
			"1086":new Flower(1086, "春暖花开", "暖暖的风，暖暖的阳光，捎上我暖暖的祝福~", 0, 1, 19, 2, 0),
			"1087":new Flower(1087, "萌主驾到", "在我心里，你就像小兔子一样温柔又可爱！", 0, 1, 199, 3, 0),
			"1129":new Flower(1129, "千姿百态", "百变的装扮，百变的心情，爱漂亮没有终点~", 29, 0, 1186, 3, 0),
			"1130":new Flower(1130, "千面女王", "百变的花朵送给我心中的百变公主！", 79, 0, 4799, 5, 0),
			"1157":new Flower(1157, "忠诚的花束", "请让我献上代表我忠诚的精美花束吧！", 29, 0, 1186, 3, 0),
			"1158":new Flower(1158, "骑士的荣耀", "这是骑士至高无上的荣耀！", 79, 0, 4599, 5, 0),
			"1161":new Flower(1161, "欢乐童真", "同桌的你，你的微笑，依旧如花灿烂~", 0, 1, 19, 2, 0),
			"1169":new Flower(1169, "粽子香包", "送给你我亲手做的粽子香包，清香幽幽，还能辟虫解毒哦~", 0, 1, 15, 2, 0),
			"1173":new Flower(1173, "闪闪金鳞", "送给阳光下金光闪闪的你", 29, 0, 1186, 3, 0),
			"1174":new Flower(1174, "梦之彩鳞", "你就像闪耀的幻彩光芒的琉璃之花", 79, 0, 4599, 5, 0),
			"1196":new Flower(1196, "夏日清风", "假如我是一阵清风，我要将快乐吹拂到你的身边。", 0, 1, 19, 2, 0),
			"1211":new Flower(1211, "曙光的祝福", "请接收我温暖又闪亮的祝福吧！", 29, 0, 1486, 3, 0),
			"1212":new Flower(1212, "永夜的守护", "在美丽清冷的月夜，静静守护着你。", 29, 0, 1486, 3, 0),
			"1213":new Flower(1213, "永夜曙光之梦", "永夜的黑暗与曙光的光辉并存，这是梦吗？", 79, 0, 4599, 5, 0),
			"1221":new Flower(1221, "一顾倾城", "如果可以，我愿陪你千年，只为眷顾你的倾城一笑。", 0, 1, 199, 3, 0),
			"1222":new Flower(1222, "牵手", "我愿陪在你的身边，牵着你的手，走一辈子……", 0, 1, 19, 2, 0),
			"1282":new Flower(1282, "阳光海盗", "送给身上充满了阳光的海盗！", 29, 0, 1186, 3, 0),
			"1283":new Flower(1283, "海上彩虹", "你的存在，犹如海上的彩虹，连人鱼也为你惊叹，为你歌唱！", 79, 0, 4599, 5, 0),
			"1322":new Flower(1322, "璀璨星空", "夜晚，我时常仰望星空……等待你的到来。", 0, 1, 199, 3, 0),
			"1395":new Flower(1395, "花好月圆", "莫思身外，且逗尊前，愿花长好，人长健，月长圆。", 29, 0, 1186, 3, 0),
			"1396":new Flower(1396, "花醉月", "花正好，月正圆，举杯凭栏寄，相思入梦影，梦也醉不醒。", 79, 0, 4599, 5, 0),
			"1419":new Flower(1419, "你是我的幸福", "无论我们相距多远，我只想说：“你是我今生最大的幸福！”", 0, 1, 19, 2, 0),
			"1427":new Flower(1427, "神之设计", "你的服装搭配得太美了，简直是神之设计呀~", 29, 0, 1186, 3, 0),
			"1428":new Flower(1428, "一见钟情", "看见你，让我怦然心动……", 79, 0, 4599, 5, 0),
			"1452":new Flower(1452, "比翼双飞", "在天愿作比翼鸟，在地愿为连理枝。", 0, 1, 199, 3, 0),
			"1482":new Flower(1482, "灵光一闪", "巴洛克灵光一闪，御用模特的服装马上就设计出来了！", 29, 0, 1186, 3, 0),
			"1483":new Flower(1483, "巴洛克之赞", "这是属于连巴洛克都感到惊叹的超级模特的花束！", 79, 0, 4299, 5, 0),
			"1499":new Flower(1499, "很高兴见到你", "前世五百次的回眸，换来今生的擦肩而过，遇见你就是我的缘。", 0, 1, 19, 2, 0),
			"1509":new Flower(1509, "才华横溢", "夜莺与玫瑰，花朵的芬芳，带来天才般的神韵！", 29, 0, 1186, 3, 0),
			"1510":new Flower(1510, "亚瑟的礼赞", "王子殿下的祝语与赞赏，如同阳光般环绕~", 79, 0, 4299, 5, 0),
			"1633":new Flower(1633, "群星璀璨", "每一颗星都有自己的光芒，任何时候都不要忘记发光哟！", 29, 0, 1186, 3, 0),
			"1634":new Flower(1634, "北极星的礼赞", "北极星将祝福赐予我们，我们便有了方向、光和幸运~", 79, 0, 4299, 5, 0),
			"1813":new Flower(1813, "星路闪耀", "鲜嫩的花朵如同星路上最闪耀的新星！", 29, 0, 1186, 3, 0),
			"1814":new Flower(1814, "主角光环", "主角光环开启，代表爱与无敌！", 79, 0, 4299, 5, 0),
			"1955":new Flower(1955, "经典·斑斓", "The one经典系列，斑斓的爱，那是对你最真挚的感情。", 289, 0, 15899, 6, 1),
			"1956":new Flower(1956, "经典·朱砂", "The one经典系列，你是我的心口的朱砂痣。", 269, 0, 14660, 6, 1),
			"1957":new Flower(1957, "经典·初心", "The one经典系列，勿忘初心，曾经的我，曾经的你。", 269, 0, 14660, 6, 1),
			"1958":new Flower(1958, "经典·佳人", "The one经典系列，世有佳人，愿君相邀。", 269, 0, 14660, 6, 1),
			"1959":new Flower(1959, "永生·一世情", "The one永生系列，一生一世，都与你情相牵", 147, 0, 7856, 6, 1),
			"1960":new Flower(1960, "永生·紫约", "The one永生系列，我留下紫色的约定，你记得来赴哦。", 149, 0, 7866, 6, 1),
			"1961":new Flower(1961, "永生·蜜月旅", "The one永生系列，甜蜜的旅行，只属于你我。", 149, 0, 7866, 6, 1),
			"1962":new Flower(1962, "永生·淳爱", "The one永生系列，纪念我们曾经的纯粹。", 149, 0, 7866, 6, 1),
			"1963":new Flower(1963, "单枝·斑斓", "The one单枝系列，单枝的彩色，也能缤纷整个世界。", 69, 0, 3488, 5, 1),
			"1964":new Flower(1964, "单枝·朱砂", "The one单枝系列，朱砂红，深印在你的心中", 69, 0, 3488, 5, 1),
			"1965":new Flower(1965, "单枝·初心", "The one单枝系列，我的初心，只有你能懂。", 69, 0, 3488, 5, 1),
			"1966":new Flower(1966, "单枝·佳人", "The one单枝系列，送给我的佳人，你还记得我吗？", 69, 0, 3488, 5, 1),
			"1967":new Flower(1967, "星座·白羊", "The one星座系列，谁说白羊座冲动的，明明我们就很可爱！", 49, 0, 2566, 4, 1),
			"1968":new Flower(1968, "星座·金牛", "The one星座系列，金牛：哪里，哪里有好吃的？", 49, 0, 2566, 4, 1),
			"1969":new Flower(1969, "星座·双子", "The one星座系列，你永远读不懂双子，也不容易赢得TA的心。", 49, 0, 2566, 4, 1),
			"1970":new Flower(1970, "星座·巨蟹", "The one星座系列，巨蟹座嘛，居家旅行必备伴侣嘛~", 49, 0, 2566, 4, 1),
			"1971":new Flower(1971, "星座·狮子", "The one星座系列，哪个有胆量挑战我狮子王？", 49, 0, 2566, 4, 1),
			"1972":new Flower(1972, "星座·处女", "The one星座系列，处女座就是洁癖怎么了，怎么了，怎么了！", 49, 0, 2566, 4, 1),
			"1973":new Flower(1973, "星座·天秤", "The one星座系列，我爱美，我爱和平，我是天秤座。", 49, 0, 2566, 4, 1),
			"1974":new Flower(1974, "星座·天蝎", "The one星座系列，神秘如我，我喂自己袋盐，我是天蝎座。", 49, 0, 2566, 4, 1),
			"1975":new Flower(1975, "星座·射手", "The one星座系列，玩玩玩，射手座最爱玩！！", 49, 0, 2566, 4, 1),
			"1976":new Flower(1976, "星座·摩羯", "The one星座系列，摩羯：腹黑？明显不是说我。", 49, 0, 2566, 4, 1),
			"1977":new Flower(1977, "星座·水瓶", "The one星座系列，水瓶座待人可和善了，哼！", 49, 0, 2566, 4, 1),
			"1978":new Flower(1978, "星座·双鱼", "The one星座系列，鱼鱼只是有那么一点点爱哭啦……", 49, 0, 2566, 4, 1),
			"2062":new Flower(2062, "金牛种花束", "世人皆说我顽固，却不知顽固的我眼中能看到的只有你！", 0, 0, 25, 3, 0),
			"2063":new Flower(2063, "白银金牛花束", "我的朋友，最真诚的友谊只是彼此的信赖！", 0, 0, 225, 3, 0),
			"2064":new Flower(2064, "炫光金牛花束", "我愿化成最可靠的港湾，成为你专属的依靠！", 0, 0, 500, 3, 0),
			"2102":new Flower(2102, "奇遇·湛蓝", "The one奇遇系列，最希望在那碧海蓝天，可你牵手到永远。", 79, 0, 4029, 5, 1),
			"2103":new Flower(2103, "奇遇·嫣红", "The one奇遇系列，你脸颊上的嫣红，是我不能忘记的美丽", 79, 0, 4029, 5, 1),
			"2104":new Flower(2104, "奇遇·枫吟", "The one奇遇系列，遇见你是最美丽的意外，以枫叶为证。", 79, 0, 4029, 5, 1),
			"2105":new Flower(2105, "奇遇·紫苏", "The one奇遇系列，紫色是高贵，紫色是华丽，紫色是神秘如你。", 79, 0, 4029, 5, 1),
			"2125":new Flower(2125, "梦想启程", "向日葵是梦想，兔尾巴草是行动！", 29, 0, 1186, 3, 0),
			"2126":new Flower(2126, "云之彼端", "梦想的云端，等待着你纵身一跃！", 79, 0, 4299, 5, 0),
			"2129":new Flower(2129, "双子花束", "双面的性格，不知道到底哪一面才是真实的自己", 0, 0, 35, 3, 0),
			"2130":new Flower(2130, "白银双子花束", "拥有两面的我，越多的接触会看到更多的不一样哦！", 0, 0, 240, 3, 0),
			"2131":new Flower(2131, "炫光双子花束", "和我在一块儿，会令你感觉到生命中充满了许多趣味！", 0, 0, 550, 3, 0),
			"2224":new Flower(2224, "巨蟹花束", "外表冰冷,但内心善良", 0, 0, 25, 3, 0),
			"2225":new Flower(2225, "白银巨蟹花束", "有火热般的热情，也洋溢着孩子般的纯洁和天真", 0, 0, 225, 3, 0),
			"2226":new Flower(2226, "炫光巨蟹花束", "使自己和别人都幸福如愿", 0, 0, 500, 3, 0),
			"2259":new Flower(2259, "狮子花束", "严于律已亦严于律人", 0, 0, 25, 3, 0),
			"2260":new Flower(2260, "白银狮子花束", "敢于竭尽全力冲破自己能量的极限", 0, 0, 225, 3, 0),
			"2261":new Flower(2261, "炫光狮子花束", "永不服输,是天生的贵族、王者", 0, 0, 500, 3, 0),
			"2274":new Flower(2274, "妙境·恒久", "The one妙境系列，世界上最美好的爱情，是恒久的陪伴", 89, 0, 4556, 5, 1),
			"2275":new Flower(2275, "妙境·情动", "The one妙境系列，情动的那一刻，感觉全世界的花都为我飞舞。", 89, 0, 4556, 5, 1),
			"2276":new Flower(2276, "妙境·道歉", "The one妙境系列，对不起，请原谅我对你造成的伤害。", 89, 0, 4556, 5, 1),
			"2277":new Flower(2277, "妙境·定情", "The one妙境系列，如果下辈子再遇见你，我也决定和你牵手。", 89, 0, 4556, 5, 1),
			"2280":new Flower(2280, "幸运星辰", "双子花加上康乃馨是双倍运气的温情！", 29, 0, 1186, 3, 0),
			"2281":new Flower(2281, "美丽心灵", "呼之而来的运气来自于心灵的洗礼！", 79, 0, 4299, 5, 0),
			"2320":new Flower(2320, "处女花束", "思虑周全,非常谦虚", 0, 0, 25, 3, 0),
			"2321":new Flower(2321, "白银处女花束", "凡事要求做到尽善尽美,是个完美主义者", 0, 0, 225, 3, 0),
			"2322":new Flower(2322, "炫光处女花束", "保持着一颗赤子之心，对未来充满着梦想", 0, 0, 500, 3, 0),
			"2374":new Flower(2374, "天秤花束", "个性稳健而理智", 0, 0, 25, 3, 0),
			"2375":new Flower(2375, "白银天秤花束", "具有天生风流倜傥的风采", 0, 0, 225, 3, 0),
			"2376":new Flower(2376, "炫光天秤花束", "具有优秀的平衡感和公正的判断力， 富有迷人的魅力", 0, 0, 500, 3, 0),
			"2401":new Flower(2401, "三周年·盛艳", "巴伦拍卖行镇店花束，三周年，盛开的艳丽！", 0, 0, 33333, 7, 0),
			"2402":new Flower(2402, "经典·3周年", "The one经典系列,奥雅3周年特别纪念版", 269, 0, 14660, 6, 1),
			"2403":new Flower(2403, "妙境·3周年", "The one妙境系列,奥雅3周年特别纪念版", 89, 0, 4556, 5, 1),
			"2404":new Flower(2404, "奇遇·3周年", "The one奇遇系列,奥雅3周年特别纪念版", 79, 0, 4029, 5, 1),
			"2405":new Flower(2405, "永生·3周年", "The one永生系列,奥雅3周年特别纪念版", 149, 0, 7866, 6, 1),
			"2406":new Flower(2406, "单枝·3周年", "The one单支系列,奥雅3周年特别纪念版", 59, 0, 3488, 5, 1),
			"2407":new Flower(2407, "梦之花", "你是我梦中的花~~", 29, 0, 1186, 3, 0),
			"2408":new Flower(2408, "美梦成真", "追逐梦想，美梦成真！", 79, 0, 4299, 5, 0),
			"2576":new Flower(2576, "魔法·契约", "The one魔法系列，魔之幻境，海誓山盟的牵绊。", 109, 0, 6056, 5, 1),
			"2577":new Flower(2577, "魔法·灵玉", "The one魔法系列，至纯至美的空灵馈赠。", 109, 0, 5556, 5, 1),
			"2578":new Flower(2578, "魔法·契约", "The one魔法系列，魔之幻境，海誓山盟的牵绊。", 109, 0, 6056, 5, 1),
			"2579":new Flower(2579, "魔法·灵玉", "The one魔法系列，至纯至美的空灵馈赠。", 109, 0, 5556, 5, 1),
			"2580":new Flower(2580, "魔法·紫眸", "The one魔法系列，回眸一笑，姹紫嫣红。", 109, 0, 5556, 5, 1),
			"2581":new Flower(2581, "魔法·虚无", "The one魔法系列，包罗万象，纵容万里。", 109, 0, 5556, 5, 1),
			"2582":new Flower(2582, "魔法幻灵", "幻化之灵，虚虚实实！", 29, 0, 1186, 3, 0),
			"2583":new Flower(2583, "魔之召唤", "光环的照耀唤起心灵的深处", 79, 0, 4299, 5, 0),
			"2814":new Flower(2814, "魔法·秋意", "The one魔法系列，秋之意境扑面而来", 129, 0, 7060, 5, 1),
			"2815":new Flower(2815, "经典·秋意", "The one经典系列,秋之意境扑面而来", 309, 0, 17560, 6, 1),
			"2816":new Flower(2816, "妙境·秋意", "The one妙境系列,秋之意境扑面而来", 99, 0, 4856, 5, 1),
			"2817":new Flower(2817, "奇遇·秋意", "The one奇遇系列,秋之意境扑面而来", 79, 0, 4029, 5, 1),
			"2818":new Flower(2818, "单枝·秋意", "The one单支系列,秋之意境扑面而来", 59, 0, 3488, 5, 1),
			"2819":new Flower(2819, "秋意恋想", "秋，思念的季节，任风将思绪千丝万缕飘洒！", 29, 0, 1186, 3, 0),
			"2820":new Flower(2820, "红叶翠柏", "朝阳甘露，加翠柏缀其间，像红绸缎上撒满珍珠", 79, 0, 4299, 5, 0),
			"2986":new Flower(2986, "珊瑚之星", "幻彩的珊瑚，明媚之星", 29, 0, 1186, 3, 0),
			"2987":new Flower(2987, "珍珠光晨", "瑰丽、高雅如珍珠般光泽", 79, 0, 4299, 5, 0),
			"2988":new Flower(2988, "海洋·明月贝", "The one海洋系列，海之浩瀚，花之泡泡", 29, 0, 1599, 3, 1),
			"2989":new Flower(2989, "海洋·炫琉璃", "The one海洋系列，海市蜃楼，虚虚幻幻", 99, 0, 5699, 5, 1),
			"2990":new Flower(2990, "海洋·幻涟漪", "The one海洋系列，烟波飘渺，广阔无垠", 269, 0, 15999, 6, 1),
			"3149":new Flower(3149, "白云朵朵", "白云飘飘朵朵开", 29, 0, 1186, 3, 0),
			"3150":new Flower(3150, "云海之星", "云之徜徉,海之荡漾,星光闪烁", 79, 0, 4299, 5, 0),
			"3312":new Flower(3312, "白色巧克力", "白色巧克力含在嘴里，甜在心里~", 29, 0, 1186, 3, 0),
			"3313":new Flower(3313, "白色之恋", "纯纯的喜爱，你是我的唯一", 79, 0, 4299, 5, 0),
			"3319":new Flower(3319, "Music Rose", "恋花阁白色情人节，响起音乐的玫瑰，", 0, 1, 12800, 6, 1),
			"3320":new Flower(3320, "爱意满怀", "恋花阁白色情人节，拥着你，就是爱意满怀", 0, 1, 15999, 6, 1),
			"3475":new Flower(3475, "苍之辰星", "漫天星，亮晶晶！思念你，是真心~", 29, 0, 1186, 3, 0),
			"3476":new Flower(3476, "苍之蜜恋", "陪你看天长地久的风景，尝海枯石烂的味道，直到…永远！", 79, 0, 4299, 5, 0),
			"3477":new Flower(3477, "苍蓝·契约", "The one苍之系列，浪漫的回眸", 395, 0, 30000, 6, 1),
			"3478":new Flower(3478, "苍蓝·灵玉", "The one苍之系列，满满的思念", 999, 0, 80000, 6, 1),
			"3479":new Flower(3479, "苍蓝·虚无", "The one苍之系列，心跳的感觉", 1785, 0, 150000, 6, 1),
			"3605":new Flower(3605, "经典·4周年", "4周年特殊花魁专用花束，花值计入特殊花魁排行榜", 49, 0, 2940, 6, 1),
			"3606":new Flower(3606, "妙境·4周年", "4周年特殊花魁专用花束，花值计入特殊花魁排行榜", 149, 0, 8940, 6, 1),
			"3607":new Flower(3607, "奇遇·4周年", "4周年特殊花魁专用花束，花值计入特殊花魁排行榜", 199, 0, 11940, 6, 1),
			"3608":new Flower(3608, "永生·4周年", "4周年特殊花魁专用花束，花值计入特殊花魁排行榜", 269, 0, 16140, 6, 1),
			"3609":new Flower(3609, "单枝·4周年", "4周年特殊花魁专用花束，花值计入特殊花魁排行榜", 369, 0, 22140, 6, 1),
			"3610":new Flower(3610, "4·千姿百态", "4周年特殊花魁专用花束，花值计入特殊花魁排行榜", 0, 0, 1320, 3, 0),
			"3611":new Flower(3611, "4·千面女王", "4周年特殊花魁专用花束，花值计入特殊花魁排行榜", 0, 0, 1320, 3, 0),
			"3612":new Flower(3612, "4·忠诚的花束", "4周年特殊花魁专用花束，花值计入特殊花魁排行榜", 0, 0, 1320, 3, 0),
			"3613":new Flower(3613, "4·骑士的荣耀", "4周年特殊花魁专用花束，花值计入特殊花魁排行榜", 0, 0, 4983, 4, 0),
			"3614":new Flower(3614, "4·梦之彩鳞", "4周年特殊花魁专用花束，花值计入特殊花魁排行榜", 0, 0, 4983, 4, 0),
			"3615":new Flower(3615, "4·永夜的守护", "4周年特殊花魁专用花束，花值计入特殊花魁排行榜", 0, 0, 4983, 4, 0),
			"3616":new Flower(3616, "4·曙光的祝福", "4周年特殊花魁专用花束，花值计入特殊花魁排行榜", 0, 0, 11643, 5, 0),
			"3617":new Flower(3617, "4·永夜曙光", "4周年特殊花魁专用花束，花值计入特殊花魁排行榜", 0, 0, 11643, 5, 0),
			"3618":new Flower(3618, "4·一见钟情", "4周年特殊花魁专用花束，花值计入特殊花魁排行榜", 0, 0, 11643, 5, 0),
			"4107":new Flower(4107, "星月·心之玫瑰", "2016年春节双人花魁专用户花束，花值计入特殊花魁排行榜", 0, 0, 1650, 3, 0),
			"4108":new Flower(4108, "星月·一顾倾城", "2016年春节双人花魁专用户花束，花值计入特殊花魁排行榜", 0, 0, 1650, 3, 0),
			"4109":new Flower(4109, "星月·一见钟情", "2016年春节双人花魁专用户花束，花值计入特殊花魁排行榜", 0, 0, 1650, 3, 0),
			"4110":new Flower(4110, "星月·比翼双飞", "2016年春节双人花魁专用户花束，花值计入特殊花魁排行榜", 0, 0, 5980, 4, 0),
			"4111":new Flower(4111, "星月·倾世", "2016年春节双人花魁专用户花束，花值计入特殊花魁排行榜", 0, 0, 5980, 4, 0),
			"4112":new Flower(4112, "星月·牵手", "2016年春节双人花魁专用户花束，花值计入特殊花魁排行榜", 0, 0, 5980, 4, 0),
			"4113":new Flower(4113, "星月·花好月圆", "2016年春节双人花魁专用户花束，花值计入特殊花魁排行榜", 0, 0, 11643, 5, 0),
			"4114":new Flower(4114, "星月·我的幸福", "2016年春节双人花魁专用户花束，花值计入特殊花魁排行榜", 0, 0, 11643, 5, 0),
			"4115":new Flower(4115, "星月·主角光环", "2016年春节双人花魁专用户花束，花值计入特殊花魁排行榜", 0, 0, 11643, 5, 0),
			"4536":new Flower(4536, "梦境·5周年", "5周年特殊花魁专用花束，花值计入特殊花魁排行榜", 0, 0, 495, 3, 0),
			"4537":new Flower(4537, "境遇·5周年", "5周年特殊花魁专用花束，花值计入特殊花魁排行榜", 0, 0, 495, 3, 0),
			"4538":new Flower(4538, "繁花·5周年", "5周年特殊花魁专用花束，花值计入特殊花魁排行榜", 0, 0, 1794, 4, 0),
			"4539":new Flower(4539, "花馨·5周年", "5周年特殊花魁专用花束，花值计入特殊花魁排行榜", 0, 0, 1794, 4, 0),
			"4540":new Flower(4540, "永生·5周年", "5周年特殊花魁专用花束，花值计入特殊花魁排行榜", 0, 0, 19980, 5, 0),
			"4541":new Flower(4541, "生机·5周年", "5周年特殊花魁专用花束，花值计入特殊花魁排行榜", 0, 0, 19980, 5, 0),
			"4542":new Flower(4542, "奇遇·5周年", "5周年特殊花魁专用花束，花值计入特殊花魁排行榜", 0, 0, 3493, 4, 0),
			"4543":new Flower(4543, "遇见·5周年", "5周年特殊花魁专用花束，花值计入特殊花魁排行榜", 0, 0, 3493, 4, 0),
			"4544":new Flower(4544, "唯一·5周年", "5周年特殊花魁专用花束，花值计入特殊花魁排行榜", 0, 0, 6660, 4, 0),
			"4545":new Flower(4545, "一心·5周年", "5周年特殊花魁专用花束，花值计入特殊花魁排行榜", 0, 0, 6660, 4, 0)

			//exportData part end
		};
		
		public static function get isSpecial():Boolean{
			return false;//每月或者年度特殊花魁，光效文件id为4，5，6
		}
		
		public static function get topBonusConfig():Object{
			if(isSpecial){
				return _topBonusConfigSpec;
			}else{
				return _topBonusConfig;
			}
		}
		
		// 某周说要改称号。。。
		private static const _topBonusConfigSpec:Object = {
			"1":{"ranking":1,"badge":[707],"sGold":10000},
			"2":{"ranking":2,"badge":[708],"sGold":5000},
			"11":{"ranking":11,"badge":[709],"sGold":3000}
		};
		
		private static const _topBonusConfig:Object = {
			"1":{"ranking":1,"badge":[55],"sGold":10000},
			"2":{"ranking":2,"badge":[56],"sGold":5000},
			"11":{"ranking":11,"badge":[57],"sGold":3000}
		};
		
		public static function get TOP1_LIGHT():int{
			if(isSpecial){
				return TOP1_SPE_LIGHT;
			}else{
				return 1;
			}
		}
		
		private static const TOP1_SPE_LIGHT:int = 4;
		
		/**
		 SELECT CONCAT('"',T.Id, '":new FlowerGift(',T.Id,',"',T.Name,'",',T.SendFlower,
		 ',',T.Score,',',T.SGold,',',IF(T.BonusItems= '', 'null', T.BonusItems),'),') FROM aox1.SendFlowerBonus T; 
		 */		
		public static const sendBonusConfig:Object = {
			"1":new FlowerGift(1,"赠花者",9,500,100,<b items="1-620-5" type="item"/>),
			"2":new FlowerGift(2,"一个好人",599,2000,500,<b items="1-620-5" type="item"/>),
			"3":new FlowerGift(3,"鲜花达人",1999,4500,1000,<b items="1-620-5" type="item"/>),
			"4":new FlowerGift(4,"稀世好人",5999,6000,2000,<b items="1-621-1" type="item"/>),
			"5":new FlowerGift(5,"爱的使者",9999,8000,3000,<b items="1-621-1" type="item"/>),
			"6":new FlowerGift(6,"浪漫爱神",99999,30000,5000,<b items="1-621-1" type="item"/>)
		};
		
		/**
		 SELECT CONCAT('"',T.Id, '":new FlowerGift(',T.Id,',"',T.Name,'",',T.FlowerCharm,
		 ',',T.Score,',',T.SGold,',',IF(T.BonusItems= '', 'null', T.BonusItems),'),') FROM aox1.FlowerCharmBonus T; 
		 */	
		public static const receiveBonusConfig:Object = {
			"1":new FlowerGift(1,"路边小草",9,500,100,<b items="1-620-5" type="item"/>),
			"2":new FlowerGift(2,"稚嫩花苞",599,1000,500,<b items="1-620-5" type="item"/>),
			"3":new FlowerGift(3,"含苞骨朵",1999,3000,1000,<b items="1-620-5" type="item"/>),
			"4":new FlowerGift(4,"初绽馨香",5999,4000,2000,<b items="1-621-1" type="item"/>),
			"5":new FlowerGift(5,"心花怒放",9999,5000,3000,<b items="1-621-1" type="item"/>),
			"6":new FlowerGift(6,"傲视群芳",99999,20000,5000,<b items="1-621-1" type="item"/>)
		};
		
		public static const dailyBonus:Object = {
			"common":{"type":1, "id":620, "num":5},
			"member":{"type":1, "id":621, "num":1}
		};
		
	}
}
