package mmo.materialdata
{
	import mmo.framework.domain.material.supermarket.SupermarketItem;

	public class SupermarketItemsData
	{
		public function SupermarketItemsData()
		{
		}
		
		//"{0}":new SupermarketItem({0}, {11}, {3}, "{1}", {4}, {5}, {6}, {7}, {8}, "{2}", {9}, {10}),
		public static const data:Object = 
			{
				//exportData part begin
				"1":new SupermarketItem(1, 0, 1, "发卡", 999999999, 1, 1, 0, 0, "精品店商品", 0, 0),
				"2":new SupermarketItem(2, 0, 1, "胸针", 999999999, 2, 1, 0, 0, "精品店商品", 0, 0),
				"3":new SupermarketItem(3, 0, 1, "发箍", 999999999, 1, 1, 0, 0, "精品店商品", 0, 0),
				"4":new SupermarketItem(4, 0, 1, "头花", 999999999, 3, 1, 0, 0, "精品店商品", 0, 0),
				"5":new SupermarketItem(5, 0, 1, "小挎包", 999999999, 2, 1, 0, 0, "精品店商品", 0, 0),
				"6":new SupermarketItem(6, 0, 1, "粉底", 999999999, 1, 1, 0, 0, "精品店商品", 0, 0),
				"7":new SupermarketItem(7, 0, 1, "唇膏", 999999999, 3, 1, 0, 0, "精品店商品", 0, 0),
				"8":new SupermarketItem(8, 0, 1, "睫毛膏", 999999999, 2, 1, 0, 0, "精品店商品", 0, 0),
				"9":new SupermarketItem(9, 0, 1, "指甲油", 999999999, 4, 1, 0, 0, "精品店商品", 0, 0),
				"10":new SupermarketItem(10, 0, 1, "香水", 999999999, 3, 1, 0, 0, "精品店商品", 0, 0),
				"11":new SupermarketItem(11, 0, 1, "小挂件", 999999999, 2, 1, 0, 0, "精品店商品", 0, 0),
				"12":new SupermarketItem(12, 0, 1, "小汽车", 999999999, 4, 1, 0, 0, "精品店商品", 0, 0),
				"13":new SupermarketItem(13, 0, 1, "小屋子", 999999999, 3, 1, 0, 0, "精品店商品", 0, 0),
				"14":new SupermarketItem(14, 0, 1, "八音盒", 999999999, 4, 1, 0, 0, "精品店商品", 0, 0),
				"15":new SupermarketItem(15, 0, 1, "毛绒公仔", 999999999, 3, 1, 0, 0, "精品店商品", 0, 0),
				"16":new SupermarketItem(16, 0, 1, "棒球帽", 999999999, 4, 1, 0, 0, "精品店商品", 0, 0),
				"17":new SupermarketItem(17, 0, 1, "淑女帽", 999999999, 5, 1, 0, 0, "精品店商品", 0, 0),
				"18":new SupermarketItem(18, 0, 1, "礼帽", 999999999, 7, 1, 0, 0, "精品店商品", 0, 0),
				"19":new SupermarketItem(19, 0, 1, "贝蕾帽", 999999999, 9, 1, 0, 0, "精品店商品", 0, 0),
				"20":new SupermarketItem(20, 0, 1, "爵士帽", 999999999, 11, 1, 0, 0, "精品店商品", 0, 0),
				"21":new SupermarketItem(21, 0, 2, "饰品商品柜", 9999, 100, 0, 0, 0, "精品店商品", 0, 0),
				"22":new SupermarketItem(22, 0, 2, "化妆品商品柜", 9999, 120, 0, 0, 0, "精品店商品", 0, 0),
				"23":new SupermarketItem(23, 0, 2, "玩具商品柜", 9999, 140, 0, 0, 0, "精品店商品", 0, 0),
				"24":new SupermarketItem(24, 0, 2, "帽子商品柜", 9999, 160, 0, 0, 0, "精品店商品", 0, 0),
				"25":new SupermarketItem(25, 4083, 3, "初级招客卡", 9999, 0, 2, 1, 0, "使用后，能够马上迎来10名顾客（对应店铺内使用），每天最多可使用5张", 0, 0),
				"26":new SupermarketItem(26, 4084, 3, "中级招客卡", 9999, 0, 7, 1, 0, "使用后，能够马上迎来30名顾客（对应店铺内使用），每天最多可使用5张", 0, 0),
				"27":new SupermarketItem(27, 4085, 3, "高级招客卡", 9999, 0, 15, 1, 0, "使用后，能够马上迎来50名顾客（对应店铺内使用），每天最多可使用5张", 0, 0),
				"28":new SupermarketItem(28, 4086, 3, "初级队列卡", 9999, 0, 2, 1, 0, "使用后，能够开启一个升级队列，有效期3天", 0, 0),
				"29":new SupermarketItem(29, 4087, 3, "中级队列卡", 9999, 0, 7, 1, 0, "使用后，能够开启一个升级队列，有效期7天", 0, 0),
				"30":new SupermarketItem(30, 4088, 3, "高级队列卡", 9999, 0, 15, 1, 0, "使用后，能够开启一个升级队列，有效期14天", 0, 0),
				"31":new SupermarketItem(31, 4089, 3, "初级时间胶囊", 9999, 0, 2, 1, 0, "使用后，能让升级队列中的工人休息时间缩短10分钟", 0, 0),
				"32":new SupermarketItem(32, 4090, 3, "中级时间胶囊", 9999, 0, 7, 1, 0, "使用后，能让升级队列中的工人休息时间缩短30分钟", 0, 0),
				"33":new SupermarketItem(33, 4091, 3, "高级时间胶囊", 9999, 0, 15, 1, 0, "使用后，能让升级队列中的工人休息时间缩短60分钟", 0, 0),
				"34":new SupermarketItem(34, 4092, 3, "安抚卡", 9999, 0, 5, 1, 0, "安抚不满意的客人，补充获得好评值和经验（普通迎客失败时使用）", 0, 0),
				"35":new SupermarketItem(35, 4203, 4, "尼龙绳", 9999, 0, 10, 1, 0, "升级热气球所需的材料之一", 0, 0),
				"36":new SupermarketItem(36, 4204, 4, "气球布料", 9999, 0, 10, 1, 0, "升级热气球所需的材料之一", 0, 0),
				"37":new SupermarketItem(37, 4205, 4, "滚轮", 9999, 0, 10, 1, 0, "升级热气球所需的材料之一", 0, 0),
				"38":new SupermarketItem(38, 4206, 4, "坐篮", 9999, 0, 10, 1, 0, "升级热气球所需的材料之一", 0, 0),
				"39":new SupermarketItem(39, 4374, 3, "贵宾重置卡", 9999, 0, 10, 1, 0, "《迎接贵宾》功能中，使用后，立刻重置列表中的贵宾", 0, 0),
				"40":new SupermarketItem(40, 4375, 3, "高级迎宾卡", 9999, 0, 10, 1, 0, "《迎接贵宾》功能中，使用后，立刻增加5次贵宾迎接次数", 0, 0),
				"41":new SupermarketItem(41, 4654, 3, "初级迎宾卡", 9999, 0, 10, 1, 0, "《迎接贵宾》功能中，使用后，立刻增加2次贵宾迎接次数", 0, 0)
				//exportData part end
			};
	}
}