package mmo.materialdata
{
	public class TwinGiftData
	{
		
		//"{0}":[{0}, "{1}", "", {3}, {2}, {4}],
		public static const GiftData:Object = {
			"1":[1, "相亲相爱熊", "", 25, 0, 0],
			"2":[2, "冠月凝光对戒", "", 35, 2, 0],
			"3":[3, "独一无二合体心形对戒", "", 50, 4, 1],
			"4":[4, "心锁一生手镯", "", 25, 0, 0],
			"5":[5, "复古典雅手镯", "", 35, 2, 0],
			"6":[6, "星钻永恒手镯", "", 50, 4, 1],
			"7":[7, "三周年•天鹅之恋", "", 66, 7, 1],
			"8":[8, "双花魁•水晶皇冠", "", 55, 6, 1],
			"9":[9, "七夕·鹊桥之约", "", 52, 5, 1],
			"10":[10, "七夕·海天相恋", "", 50, 4, 1],
			"11":[11, "中秋•千里婵娟", "", 52, 5, 1],
			"12":[12, "团圆•月桂玄兔", "", 50, 4, 1],
			"13":[13, "海洋の心", "", 45, 5, 1],
			"14":[14, "瓶中砂", "", 40, 4, 1],
			"15":[15, "雕刻时光", "", 99, 7, 1],
			"16":[16, "双生·束缚", "", 99, 9, 0],
			"17":[17, "双生·祈祷", "", 99, 6, 0],
			"18":[18, "双生·喵喵", "", 99, 3, 0]
		};
		
		public static const BoxPrice:Object = {
			"1":1,
			"2":2,
			"3":4,
			"4":5,
			"5":5,
			"6":5
		};
		
		public function TwinGiftData()
		{
		}
	}
}